In [2]:
import pandas as pd
dict = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
df = pd.DataFrame(dict)
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [5]:
import numpy as np
exam_data = {
                'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
                'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19]
            }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df1 = pd.DataFrame(exam_data,index = labels)
df1

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
attempts    10 non-null int64
name        10 non-null object
qualify     10 non-null object
score       8 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [7]:
df1.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

In [8]:
df1.iloc[:3]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

In [15]:
df1[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [21]:
df1.iloc[[1,3,5,6],[1,3]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [29]:
df1[df1.attempts > 2]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

In [30]:
df1[df1['attempts'] > 2]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

In [34]:
df1.shape
aa1 = df1.shape
aa1
print('Numer of Rows:',aa1[0])
print('Number of Columns:',aa1[1])

Numer of Rows: 10
Number of Columns: 4

In [45]:
df1[df1['score'].isnull()]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

In [46]:
df1[df1['score'].between(15,20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

In [49]:
df1[(df1.score >= 15) & (df1.score <= 20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

In [51]:
df1[(df1.attempts < 3) & (df1.score > 15)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0

In [52]:
df1.loc['d','score'] = 11.5
df1

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [53]:
df1.attempts.sum()

19

In [54]:
df1.score.mean()

13.333333333333334

In [81]:
df1.loc['d','score'].np.fillna

AttributeError: 'numpy.float64' object has no attribute 'np'

In [61]:
df1[(df1.loc['d','score']==11.5) [df1.loc['d','score'] = np.nan]]

SyntaxError: invalid syntax (<ipython-input-61-a5696382b7bc>, line 1)

In [78]:
df1.loc['d','score'] = df1.loc['d','score'].replace(11.5,np.nan)

AttributeError: 'numpy.float64' object has no attribute 'replace'